## Repaso Numpy y Pandas

1. Crea un array de 5x2 con los valores desde 100 hasta 200 de 10 en 10

In [1]:
import numpy as np
array = np.arange(100,201,10)

2. Redimensiona el array a 3x3 (se debe de eliminar el último elemento)

In [28]:
if array[-1] == 190: array = array[0:-1]

array = array.reshape(3,3)
print(array)

[[100 110 120]
 [130 140 150]
 [160 170 180]]

3. Crea un array con los elementos de la tercera posición de cada fila

In [34]:
array2 = array[:,2]
print(array2)

[120 150 180]

4. Muestra los elementos de las filas de posición par y columna de posición impar

In [38]:
array[0::2,1::2]

array([[110],
       [170]])

5. Crea dos arrays de 2x3. Posteriormente suma los dos arrays y a su resultado eleva al cuadrado cada elemento

In [41]:
array1 = np.random.randint(1,200,(2,3))
array2 = np.random.randint(1,200,(2,3))
print(array1)
print(array2)

resultado = array1 + array2
resultado **= 2
resultado

[[ 64 193  18]
 [ 55  94 189]]
[[106  62  14]
 [ 90  43  65]]

array([[28900, 65025,  1024],
       [21025, 18769, 64516]])

6. Crea un array de 8x3. Posteriormente dividelo en 4 subarrays

In [42]:
array4 = np.random.randint(1,200,(8,3))
array4.reshape(6,4)

array([[143, 103, 114,  83],
       [133,  91, 152, 104],
       [ 42,   2, 145,  83],
       [ 77, 196,  51, 186],
       [154, 183, 109,  58],
       [160,  81, 160,  82]])

7. Dado un array de 3x3. Crea un nuevo array con este ordenado por la 2ª fila y otro array con este array ordenado por la 2ª columna

In [76]:
array5 = np.random.randint(1,200,(3,3))
print(array5)
print()

array2f = array5.copy()
array2f[1,:] = np.sort(array2f[1,:])

print(array2f)
print()

array2c = array5.copy()
array2c[:,1] = np.sort(array2c[:,1])

print(array2c)

[[159 197  90]
 [ 29 154 120]
 [ 29  20   1]]

[[159 197  90]
 [ 29 120 154]
 [ 29  20   1]]

[[159  20  90]
 [ 29 154 120]
 [ 29 197   1]]

8. Dado un array de 3x3. Devuelve sus mínimos de cada columna y el máximo de cada fila

In [2]:
import pandas as pd

array6 = np.random.randint(1,200,(3,3))
df = pd.DataFrame(array6)
print(df)

minC = pd.Series(df.min(axis=0))
maxF = pd.Series(df.max(axis=1))
df["Max Fila"] = maxF
df.loc["Min Col"] = minC

df

     0    1    2
0   58  149  176
1  132   80  102
2  180   63   32

             0      1      2  Max Fila
0         58.0  149.0  176.0     176.0
1        132.0   80.0  102.0     132.0
2        180.0   63.0   32.0     180.0
Min Col   58.0   63.0   32.0       NaN

9. Dado un array de 3x3 elimina su 2ª columna y añadela al inicio

In [122]:
df2 = pd.DataFrame(np.random.randint(1,200,(3,3)))
print(df2)

#Obtneros la serie que queremos poner al principio
primC = df2.iloc[:,1]

#Eliminamos la columna que ya tenemos
df2 = df2.drop(columns=1)

#Ponemos al principio
df2.insert(0,"1",primC)
df2

     0   1    2
0  153  99  178
1  149  17   61
2  141   9  172

    1    0    2
0  99  153  178
1  17  149   61
2   9  141  172

10. Crea un DataFrame con la información de *coches.csv*

In [3]:
coches = pd.read_csv("coches.csv")
coches

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...,...
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

11. Muestra la compañía que tenga el coche más caro

In [132]:
coches[coches.price == coches.price.max()].company

35    mercedes-benz
Name: company, dtype: object

12. Muestra todos los coches de Toyota

In [134]:
coches[coches.company == "toyota"]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

13. Muestra cuántos coches tiene cada compañía

In [136]:
coches.groupby(["company"])["company"].count()

company
alfa-romero      3
audi             4
bmw              6
chevrolet        3
dodge            2
honda            3
isuzu            3
jaguar           3
mazda            5
mercedes-benz    4
mitsubishi       4
nissan           5
porsche          3
toyota           7
volkswagen       4
volvo            2
Name: company, dtype: int64

14. Muestra todas las compañías con su precio más caro

In [4]:
coches.groupby(["company"])[["company","price"]].agg({"price":np.max})

                 price
company
alfa-romero    16500.0
audi           18920.0
bmw            41315.0
chevrolet       6575.0
dodge           6377.0
honda          12945.0
isuzu           6785.0
jaguar         36000.0
mazda          18344.0
mercedes-benz  45400.0
mitsubishi      8189.0
nissan         13499.0
porsche        37028.0
toyota         15750.0
volkswagen      9995.0
volvo          13415.0

15. Calcula la media de kilometros de cada compañía

In [10]:
coches.groupby(["company"])[["company","average-mileage"]].agg({"average-mileage":np.mean})

               average-mileage
company
alfa-romero          20.333333
audi                 20.000000
bmw                  19.000000
chevrolet            41.000000
dodge                31.000000
honda                26.333333
isuzu                33.333333
jaguar               14.333333
mazda                28.000000
mercedes-benz        18.000000
mitsubishi           29.500000
nissan               31.400000
porsche              17.000000
toyota               28.714286
volkswagen           31.750000
volvo                23.000000

16. Ordena los coches por precio

In [11]:
coches.sort_values(by=["price"])

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
27,36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
36,49,mitsubishi,hatchback,93.7,157.3,ohc,four,68,37,5389.0
28,37,mazda,hatchback,93.1,159.1,ohc,four,68,31,6095.0
...,...,...,...,...,...,...,...,...,...,...
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN